tap "daipeihust/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "ngrok/ngrok"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "romkatv/powerlevel10k"
tap "theeternalsw0rd/telnet"
brew "ack"
brew "python@3.11"
brew "autojump"
brew "docutils", link: false
brew "awscli", link: false
brew "gettext"
brew "zstd"
brew "chafa"
brew "direnv"
brew "docker-compose"
brew "fd"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "helix"
brew "jq"
brew "lazygit"
brew "libfido2"
brew "libssh"
brew "lua"
brew "lua-language-server"
brew "tree-sitter"
brew "neovim"
brew "node"
brew "nvm"
brew "prettier"
brew "python@3.10"
brew "ripgrep"
brew "rust-analyzer"
brew "stylua"
brew "telnet"
brew "tmux"
brew "typescript"
brew "universal-ctags"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "daipeihust/tap/im-select"
brew "rhyeal/aws-rotate-iam-keys/aws-rotate-iam-keys"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "alacritty"
cask "dbeaver-community"
cask "figma"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "mongodb-compass"
cask "ngrok"
cask "notion"
cask "slack"
cask "visual-studio-code"
vscode "adpyke.codesnap"
vscode "arcanis.vscode-zipfs"
vscode "bungcip.better-toml"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "haskell.haskell"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "PKief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rust-lang.rust-analyzer"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
