tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "romkatv/powerlevel10k"

brew "git"
brew "mas"

brew "autojump"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

brew "awscli"
brew "gh"
brew "git-delta"
brew "lazygit"
brew "neovim"
brew "gnu-sed"
brew "ripgrep"
brew "yarn"
brew "nvm"
brew "node"
brew "tmux"

cask "alacritty"
cask "figma"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "notion"
cask "slack"
cask "visual-studio-code"

mas "KakaoTalk"

vscode "adpyke.codesnap"
vscode "arcanis.vscode-zipfs"
vscode "bungcip.better-toml"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "formulahendry.auto-rename-tag"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "streetsidesoftware.code-spell-checker"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
