tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "rhyeal/aws-rotate-iam-keys", "https://github.com/rhyeal/aws-rotate-iam-keys"
tap "romkatv/powerlevel10k"
brew "ack"
brew "autojump"
brew "awscli"
brew "direnv"
brew "fd"
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "node"
brew "nvm"
brew "powerlevel10k"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "aldente"
cask "docker"
cask "figma"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-symbols-only-nerd-font"
cask "google-chrome"
cask "mongodb-compass"
cask "notion"
cask "rectangle"
cask "slack"
cask "visual-studio-code"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RunCat", id: 1429033973
vscode "adpyke.codesnap"
vscode "arcanis.vscode-zipfs"
vscode "ChakrounAnas.turbo-console-log"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "SimonSiefke.svg-preview"
vscode "streetsidesoftware.code-spell-checker"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
